/* LeoCol user-facing strings */

"Button.Reload" = "Reload";
"Label.Filter" = "Filter:";
"Label.ProcessDetails" = "Process Details";

"Column.Process" = "Process";
"Column.PID" = "PID";
"Column.BundleName" = "Bundle Name";
"Column.Observed" = "Last Seen";
"Column.Executable" = "Executable";
"Column.Classification" = "Classification";

"Detail.NoSelection" = "No process selected.";

"Detail.Process" = "Process";
"Detail.PID" = "PID";
"Detail.Bundle" = "Bundle";
"Detail.BundleName" = "Bundle Name";
"Detail.Classification" = "Classification";
"Detail.Confidence" = "Confidence";
"Detail.Executable" = "Executable";
"Detail.FirstSeen" = "First Seen";
"Detail.LastSeen" = "Last Seen";
"Detail.ExecutablePath" = "Executable Path";

"State.NotAvailable" = "Not available";
"State.Classification.ObservedOnly" = "Observed only";
"State.Confidence.NotAvailable" = "Not available";
"State.Executable.NotReported" = "Not reported";
"State.Executable.NotReported.Detail" = "No executable path reported";
"State.Executable.Present" = "Present";
"State.Executable.NotPresent" = "Not present";
"State.Executable.Directory" = "Directory";


"Status.ShowingRows" = "Showing %lu of %lu rows";
"Status.DatabaseNotFound" = "Database not found: %@ — showing fallback rows";
"Status.DatabaseOpenFailed" = "Could not open database: %@";
"Status.QueryPrepareFailed" = "Query prepare failed — showing fallback rows";
"Status.QueryFailed" = "Query failed — showing fallback rows";
"Status.ResultIterationFailed" = "Result iteration failed";
"Status.EmptyDatabase" = "Database returned no rows — showing fallback rows";


"Classification.AppleSystemComponent" = "Apple system component";
"Classification.AppleApplication" = "Apple application";
"Classification.CommandLineTool" = "Command-line tool";
"Classification.UserApplication" = "User application";
"Classification.DeveloperTool" = "Developer tool";
"Classification.MacPortsTool" = "MacPorts tool";
"Classification.ObservedOnly" = "Observed only";

"Button.EvidenceSummary" = "Evidence";
"Button.OK" = "OK";

"EvidenceSummary.Title" = "Provenance Evidence Summary";
"EvidenceSummary.Empty" = "No provenance evidence available.";

"EvidenceType.launch-agent" = "LaunchAgent";
"EvidenceType.launch-daemon" = "LaunchDaemon";
"EvidenceType.login-item" = "Login Item";
"EvidenceType.startup-item" = "StartupItem";
"EvidenceType.kext" = "Kernel Extension";
"EvidenceType.cups" = "CUPS";
"EvidenceType.receipt-bom" = "Receipt/BOM";

"ResolutionState.resolved" = "Resolved";
"ResolutionState.observed-only" = "Observed only";
"ResolutionState.unresolved" = "Unresolved";
"ResolutionState.stale-reference" = "Stale reference";
"ResolutionState.artifact" = "Artifact";

"About.Title" = "About LeoCol";
"About.Message" = "LeoCol";
"About.Info" = "Read-only process and provenance memory for Mac OS X Leopard.\n\nLeoCol records evidence, not verdicts.\nIt is not a task manager, cleaner, uninstaller, repair tool, or malware scanner.";
"Menu.Quit" = "Quit";
"Menu.QuitLeoCol" = "Quit LeoCol";
"About.VersionFormat" = "Version %@ (%@)";
"Label.Search" = "Search";
"Column.EvidenceType" = "Evidence Type";
"Column.ResolutionState" = "State";
"Column.Count" = "Count";
"Menu.File" = "File";
"Menu.ExportReport" = "Export Report...";
"Export.DefaultFileName" = "LeoCol-Report.txt";
"Export.FailedTitle" = "Export Failed";
"Export.FailedInfo" = "LeoCol could not write the report file.";
"Report.Title" = "LeoCol Report";
"Report.Label.Version" = "Version";
"Report.Label.Exported" = "Exported";
"Report.Label.Database" = "Database";
"Report.Label.Search" = "Search";
"Report.Label.VisibleRows" = "Visible process rows";
"Report.NoActiveSearch" = "Not active";
"Report.VisibleRowsFormat" = "%lu of %lu";
"Report.Section.Processes" = "Processes";
"Report.Section.Provenance" = "Provenance Evidence Summary";
"Report.Section.Boundary" = "Boundary";
"Report.ProcessHeader" = "Process\tPID\tInstance\tBundle\tLast seen\tExecutable\tClassification";
"Report.EvidenceHeader" = "Evidence Type\tState\tCount";
"Report.Boundary.Evidence" = "LeoCol records evidence, not verdicts.";
"Report.Boundary.ReadOnly" = "This report is read-only documentation.";
"Menu.View" = "View";
"Menu.ShowSnapshots" = "Show Snapshots";
"SnapshotOverview.Title" = "Snapshots";
"Column.SnapshotID" = "Snapshot ID";
"Column.ObservedAt" = "Observed At";
"Column.Source" = "Source";
"Column.ProcessCount" = "Processes";
"Menu.UpdateSnapshot" = "Update Snapshot";
"Operation.UpdateSnapshot.Title" = "Update Snapshot";
"Operation.UpdateSnapshot.Starting" = "Updating snapshot...";
"Operation.UpdateSnapshot.Completed" = "Snapshot update completed.";
"Operation.UpdateSnapshot.WarningFormat" = "Snapshot update completed with %lu warning(s).";
"Operation.Stage.JournalProbe" = "Journal probe";
"Operation.Stage.LifecycleProbe" = "Lifecycle probe";
"Operation.Stage.IdentityProbe" = "Identity probe";
"Operation.HelperMissingFormat" = "Missing helper: %@";
"Operation.HelperFailedFormat" = "%@ failed.";
"Column.InstanceStatus" = "Instance";
"Detail.InstanceStatus" = "Instance";
"InstanceStatus.Current" = "Current";
"InstanceStatus.Historical" = "Historical";
"Menu.UpdateEvidence" = "Update Evidence";
"Operation.UpdateEvidence.Title" = "Update Evidence";
"Operation.UpdateEvidence.Starting" = "Updating evidence...";
"Operation.UpdateEvidence.Completed" = "Evidence update completed.";
"Operation.UpdateEvidence.WarningFormat" = "Evidence update completed with %lu warning(s).";
"Operation.Stage.LaunchSourcesProbe" = "Launch sources probe";
"Operation.Stage.LoginItemsProbe" = "Login items probe";
"Operation.Stage.StartupItemsProbe" = "StartupItems probe";
"Operation.Stage.KextProbe" = "Kernel extensions probe";
"Operation.Stage.CUPSProbe" = "CUPS probe";
"Operation.Stage.ReceiptBOMProbe" = "Receipt/BOM probe";
"Menu.Help" = "Help";
"Menu.LeoColHelp" = "LeoCol Help";
"Status.HelpNotFound" = "LeoCol Help was not found.";
